Repository: HotCakeX/Harden-Windows-Security
Catalog: AppControl Manager/Strings/*/Resources.resw
Source language: en_us
Languages: ar, de_de, el_gr, es, fr_fr, he_il, hi_in, ja_jp, ml_in, pl_pl, tr_tr

# RequireEVSignersRuleOption.AutomationProperties.HelpText
source: Indicates that the created/deployed policy will have (Require EV Signers) policy rule option which will only allow kernel-mode drivers signed with an EV certificate to run.
ar: يشير إلى أن النهج الذي تم إنشاؤه/نشره سيحتوي على خيار النهج (طلب موقعي EV) والذي سيسمح فقط بتشغيل برامج تشغيل وضع النواة الموقعة بشهادة EV.
de_de: Gibt an, dass die erstellte/bereitgestellte Richtlinie die Richtlinienregeloption (Require EV Signers) enthält, die nur Kernelmodustreiber zulässt, die mit einem EV-Zertifikat signiert sind.
el_gr: Υποδεικνύει ότι η δημιουργημένη/αναπτυγμένη πολιτική θα έχει την επιλογή κανόνα πολιτικής (Απαιτείται EV Signers) η οποία θα επιτρέπει μόνο στους οδηγούς λειτουργίας πυρήνα που είναι υπογεγραμμένοι με πιστοποιητικό EV να εκτελούνται.
es: Indica que la directiva creada/implementada tendrá la opción de regla de directiva (Requerir firmantes EV) que solo permitirá ejecutar controladores en modo kernel firmados con un certificado EV.
fr_fr: Indique que la stratégie créée/déployée aura l'option de règle de stratégie (Require EV Signers) qui autorisera uniquement l'exécution des pilotes en mode noyau signés avec un certificat EV.
he_il: מציין שהמדיניות שנוצרה/נפרסה תכלול את אפשרות חוק המדיניות (דרוש חותמי EV) שתאפשר רק להפעיל מנהלי התקנים במצב ליבה שחתומים עם תעודת EV.
hi_in: निर्मित/तैनात नीति में (EV साइनर्स आवश्यक) नीति नियम विकल्प होगा, जो केवल EV प्रमाणपत्र से साइन किए गए कर्नेल-मोड ड्राइवर को चलने की अनुमति देगा।
ja_jp: 作成/展開されたポリシーに (Require EV Signers) ポリシールールオプションが含まれ、EV証明書で署名されたカーネルモードドライバーのみを実行許可することを示します。
ml_in: സൃഷ്ടിച്ച/വിന്യസിച്ച നയത്തിന് (EV സൈനർമാർ ആവശ്യമുണ്ട്) നയ നിയമ ഓപ്ഷൻ ഉണ്ടായിരിക്കുമെന്നും ഇത് ഒരു EV സർട്ടിഫിക്കറ്റ് ഉപയോഗിച്ച് ഒപ്പിട്ട കേർണൽ-മോഡ് ഡ്രൈവറുകൾക്ക് മാത്രം പ്രവർത്തിക്കാൻ അനുമതി നൽകുമെന്നും സൂചിപ്പിക്കുന്നു.
pl_pl: Wskazuje, że utworzone/wdrożone zasady będą miały opcję zasad (Wymagaj podpisujących EV), która zezwoli na uruchamianie tylko sterowników trybu jądra podpisanych certyfikatem EV.
tr_tr: Oluşturulan/dağıtılan politikanın, yalnızca EV sertifikasıyla imzalanmış çekirdek modu sürücülerin çalıştırılmasına izin verecek (EV İmzalayanları Gerektir) politika kuralı seçeneğine sahip olacağını belirtir.

# EnableScriptEnforcementRuleOption.Description
source: Enables script enforcement for the policy which will severely limit the attack surface of PowerShell by requiring only scripts/modules signed and allowed in the Code Integrity policy to run.
ar: يمكّن فرض البرامج النصية للنهج مما يحد بشدة من سطح الهجوم لـ PowerShell من خلال طلب تشغيل البرامج النصية/الوحدات النمطية الموقعة والمسموح بها فقط في نهج تكامل التعليمات البرمجية.
de_de: Aktiviert die Skripterzwingung für die Richtlinie, wodurch die Angriffsfläche von PowerShell erheblich reduziert wird, indem nur Skripte/Module zugelassen werden, die signiert sind und in der Codeintegritätsrichtlinie ausgeführt werden dürfen.
el_gr: Ενεργοποιεί την επιβολή σεναρίων για την πολιτική, η οποία θα περιορίσει σοβαρά την επιφάνεια επίθεσης του PowerShell απαιτώντας μόνο σενάρια/μονάδες που είναι υπογεγραμμένα και επιτρέπονται στην πολιτική Ακεραιότητας Κώδικα να εκτελούνται.
es: Habilita la aplicación obligatoria de scripts para la directiva, lo que limitará severamente la superficie de ataque de PowerShell al exigir que solo se ejecuten los scripts/módulos firmados y permitidos en la directiva de integridad de código.
fr_fr: Active l'application de script pour la stratégie, ce qui limitera considérablement la surface d'attaque de PowerShell en exigeant que seuls les scripts/modules signés et autorisés dans la stratégie d'intégrité du code s'exécutent.
he_il: מאפשר אכיפת סקריפטים למדיניות, מה שיגביל באופן חמור את משטח התקיפה של PowerShell על ידי דרישה שרק סקריפטים/מודולים חתומים ומורשים במדיניות שלמות הקוד יופעלו.
hi_in: नीति के लिए स्क्रिप्ट प्रवर्तन सक्षम करता है, जो केवल कोड इंटीग्रिटी नीति में साइन और अनुमत स्क्रिप्ट/मॉड्यूल को चलने की अनुमति देकर PowerShell के हमले की सतह को गंभीरता से सीमित करेगा।
ja_jp: ポリシーのスクリプト強制を有効にします。これにより、コード整合性ポリシーで許可され署名されたスクリプト/モジュールのみを実行要求することで、PowerShellの攻撃対象領域を大幅に制限します。
ml_in: നയത്തിനായി സ്ക്രിപ്റ്റ് എൻഫോഴ്സ്മെന്റ് പ്രവർത്തനക്ഷമമാക്കുന്നു, ഇത് കോഡ് ഇന്റഗ്രിറ്റി നയത്തിൽ ഒപ്പിട്ടതും അനുവദനീയവുമായ സ്ക്രിപ്റ്റുകൾ/മൊഡ്യൂളുകൾ മാത്രം പ്രവർത്തിപ്പിക്കാൻ ആവശ്യപ്പെടുന്നതിലൂടെ PowerShell-ന്റെ ആക്രമണ സാധ്യതയെ സാരമായി പരിമിതപ്പെടുത്തും.
pl_pl: Włącza wymuszanie skryptów dla zasad, co znacznie ograniczy powierzchnię ataku PowerShell, wymagając uruchamiania tylko skryptów/modułów podpisanych i dozwolonych w zasadach integralności kodu.
tr_tr: Yalnızca Kod Bütünlüğü ilkesinde imzalanmış ve çalıştırılmasına izin verilen komut dosyalarının/modüllerin çalışmasını gerektirerek PowerShell'in saldırı yüzeyini ciddi şekilde sınırlandıracak olan politika için komut dosyası uygulamasını etkinleştirir.

# EnableScriptEnforcementRuleOption.Header
source: Enable Script Enforcement
ar: تمكين فرض البرامج النصية
de_de: Skripterzwingung aktivieren
el_gr: Ενεργοποίηση Επιβολής Σεναρίων
es: Habilitar aplicación de scripts
fr_fr: Activer l'application de script
he_il: הפעל אכיפת סקריפטים
hi_in: स्क्रिप्ट प्रवर्तन सक्षम करें
ja_jp: スクリプト強制を有効化
ml_in: സ്ക്രിപ്റ്റ് എൻഫോഴ്സ്മെന്റ് പ്രവർത്തനക്ഷമമാക്കുക
pl_pl: Włącz wymuszanie skryptów
tr_tr: Komut Dosyası Uygulamasını Etkinleştir

# EnableScriptEnforcementRuleOption.ToolTipService.ToolTip
source: Enables script enforcement for the policy which will severely limit the attack surface of PowerShell by requiring only scripts/modules signed and allowed in the Code Integrity policy to run.
ar: يمكّن فرض البرامج النصية للنهج مما يحد بشدة من سطح الهجوم لـ PowerShell من خلال طلب تشغيل البرامج النصية/الوحدات النمطية الموقعة والمسموح بها فقط في نهج تكامل التعليمات البرمجية.
de_de: Aktiviert die Skripterzwingung für die Richtlinie, wodurch die Angriffsfläche von PowerShell erheblich reduziert wird, indem nur Skripte/Module zugelassen werden, die signiert sind und in der Codeintegritätsrichtlinie ausgeführt werden dürfen.
el_gr: Ενεργοποιεί την επιβολή σεναρίων για την πολιτική, η οποία θα περιορίσει σοβαρά την επιφάνεια επίθεσης του PowerShell απαιτώντας μόνο σενάρια/μονάδες που είναι υπογεγραμμένα και επιτρέπονται στην πολιτική Ακεραιότητας Κώδικα να εκτελούνται.
es: Habilita la aplicación obligatoria de scripts para la directiva, lo que limitará severamente la superficie de ataque de PowerShell al exigir que solo se ejecuten los scripts/módulos firmados y permitidos en la directiva de integridad de código.
fr_fr: Active l'application de script pour la stratégie, ce qui limitera considérablement la surface d'attaque de PowerShell en exigeant que seuls les scripts/modules signés et autorisés dans la stratégie d'intégrité du code s'exécutent.
he_il: מאפשר אכיפת סקריפטים למדיניות, מה שיגביל באופן חמור את משטח התקיפה של PowerShell על ידי דרישה שרק סקריפטים/מודולים חתומים ומורשים במדיניות שלמות הקוד יופעלו.
hi_in: नीति के लिए स्क्रिप्ट प्रवर्तन सक्षम करता है, जो केवल कोड इंटीग्रिटी नीति में साइन और अनुमत स्क्रिप्ट/मॉड्यूल को चलने की अनुमति देकर PowerShell के हमले की सतह को गंभीरता से सीमित करेगा।
ja_jp: ポリシーのスクリプト強制を有効にします。これにより、コード整合性ポリシーで許可され署名されたスクリプト/モジュールのみを実行要求することで、PowerShellの攻撃対象領域を大幅に制限します。
ml_in: നയത്തിനായി സ്ക്രിപ്റ്റ് എൻഫോഴ്സ്മെന്റ് പ്രവർത്തനക്ഷമമാക്കുന്നു, ഇത് കോഡ് ഇന്റഗ്രിറ്റി നയത്തിൽ ഒപ്പിട്ടതും അനുവദനീയവുമായ സ്ക്രിപ്റ്റുകൾ/മൊഡ്യൂളുകൾ മാത്രം പ്രവർത്തിപ്പിക്കാൻ ആവശ്യപ്പെടുന്നതിലൂടെ PowerShell-ന്റെ ആക്രമണ സാധ്യതയെ സാരമായി പരിമിതപ്പെടുത്തും.
pl_pl: Włącza wymuszanie skryptów dla zasad, co znacznie ograniczy powierzchnię ataku PowerShell, wymagając uruchamiania tylko skryptów/modułów podpisanych i dozwolonych w zasadach integralności kodu.
tr_tr: Yalnızca Kod Bütünlüğü ilkesinde imzalanmış ve çalıştırılmasına izin verilen komut dosyalarının/modüllerin çalışmasını gerektirerek PowerShell'in saldırı yüzeyini ciddi şekilde sınırlandıracak olan politika için komut dosyası uygulamasını etkinleştirir.

# EnableScriptEnforcementRuleOption.AutomationProperties.HelpText
source: Enables script enforcement for the policy which will severely limit the attack surface of PowerShell by requiring only scripts/modules signed and allowed in the Code Integrity policy to run.
ar: يمكّن فرض البرامج النصية للنهج مما يحد بشدة من سطح الهجوم لـ PowerShell من خلال طلب تشغيل البرامج النصية/الوحدات النمطية الموقعة والمسموح بها فقط في نهج تكامل التعليمات البرمجية.
de_de: Aktiviert die Skripterzwingung für die Richtlinie, wodurch die Angriffsfläche von PowerShell erheblich reduziert wird, indem nur Skripte/Module zugelassen werden, die signiert sind und in der Codeintegritätsrichtlinie ausgeführt werden dürfen.
el_gr: Ενεργοποιεί την επιβολή σεναρίων για την πολιτική, η οποία θα περιορίσει σοβαρά την επιφάνεια επίθεσης του PowerShell απαιτώντας μόνο σενάρια/μονάδες που είναι υπογεγραμμένα και επιτρέπονται στην πολιτική Ακεραιότητας Κώδικα να εκτελούνται.
es: Habilita la aplicación obligatoria de scripts para la directiva, lo que limitará severamente la superficie de ataque de PowerShell al exigir que solo se ejecuten los scripts/módulos firmados y permitidos en la directiva de integridad de código.
fr_fr: Active l'application de script pour la stratégie, ce qui limitera considérablement la surface d'attaque de PowerShell en exigeant que seuls les scripts/modules signés et autorisés dans la stratégie d'intégrité du code s'exécutent.
he_il: מאפשר אכיפת סקריפטים למדיניות, מה שיגביל באופן חמור את משטח התקיפה של PowerShell על ידי דרישה שרק סקריפטים/מודולים חתומים ומורשים במדיניות שלמות הקוד יופעלו.
hi_in: नीति के लिए स्क्रिप्ट प्रवर्तन सक्षम करता है, जो केवल कोड इंटीग्रिटी नीति में साइन और अनुमत स्क्रिप्ट/मॉड्यूल को चलने की अनुमति देकर PowerShell के हमले की सतह को गंभीरता से सीमित करेगा।
ja_jp: ポリシーのスクリプト強制を有効にします。これにより、コード整合性ポリシーで許可され署名されたスクリプト/モジュールのみを実行要求することで、PowerShellの攻撃対象領域を大幅に制限します。
ml_in: നയത്തിനായി സ്ക്രിപ്റ്റ് എൻഫോഴ്സ്മെന്റ് പ്രവർത്തനക്ഷമമാക്കുന്നു, ഇത് കോഡ് ഇന്റഗ്രിറ്റി നയത്തിൽ ഒപ്പിട്ടതും അനുവദനീയവുമായ സ്ക്രിപ്റ്റുകൾ/മൊഡ്യൂളുകൾ മാത്രം പ്രവർത്തിപ്പിക്കാൻ ആവശ്യപ്പെടുന്നതിലൂടെ PowerShell-ന്റെ ആക്രമണ സാധ്യതയെ സാരമായി പരിമിതപ്പെടുത്തും.
pl_pl: Włącza wymuszanie skryptów dla zasad, co znacznie ograniczy powierzchnię ataku PowerShell, wymagając uruchamiania tylko skryptów/modułów podpisanych i dozwolonych w zasadach integralności kodu.
tr_tr: Yalnızca Kod Bütünlüğü ilkesinde imzalanmış ve çalıştırılmasına izin verilen komut dosyalarının/modüllerin çalışmasını gerektirerek PowerShell'in saldırı yüzeyini ciddi şekilde sınırlandıracak olan politika için komut dosyası uygulamasını etkinleştirir.

# TestModeRuleOption.Description
source: Indicates that the created/deployed policy will have (Enabled:Boot Audit on Failure) and (Enabled:Advanced Boot Options Menu) policy rule options. Useful for testing the policy and having recovery options available when something goes wrong. Not recommended to be used in the final production-ready policy due to security reasons.
ar: يشير إلى أن النهج الذي تم إنشاؤه/نشره سيحتوي على خياري النهج (ممكّن: تدقيق التمهيد عند الفشل) و (ممكّن: قائمة خيارات التمهيد المتقدمة). مفيد لاختبار النهج وتوفير خيارات استرداد عند حدوث خطأ ما. لا يوصى باستخدامه في النهج النهائي الجاهز للإنتاج لأسباب أمنية.
de_de: Gibt an, dass die erstellte/bereitgestellte Richtlinie die Richtlinienregeloptionen (Enabled:Boot Audit on Failure) und (Enabled:Advanced Boot Options Menu) enthält. Nützlich zum Testen der Richtlinie und um Wiederherstellungsoptionen zur Verfügung zu haben, wenn etwas schiefgeht. Aus Sicherheitsgründen wird die Verwendung in der endgültigen produktionsreifen Richtlinie nicht empfohlen.
el_gr: Υποδεικνύει ότι η δημιουργημένη/αναπτυγμένη πολιτική θα έχει τις επιλογές κανόνων πολιτικής (Ενεργοποιημένο: Έλεγχος Εκκίνησης σε Αποτυχία) και (Ενεργοποιημένο: Προηγμένο Μενού Επιλογών Εκκίνησης). Χρήσιμο για τη δοκιμή της πολιτικής και τη διαθεσιμότητα επιλογών ανάκτησης όταν κάτι πάει στραβά. Δεν συνιστάται να χρησιμοποιείται στην τελική πολιτική έτοιμη για παραγωγή για λόγους ασφαλείας.
es: Indica que la directiva creada/implementada tendrá las opciones de regla de directiva (Habilitar:auditoría de arranque al fallar) y (Habilitar:menú de opciones avanzadas de arranque). Útil para probar la directiva y contar con opciones de recuperación disponibles cuando algo salga mal. No se recomienda su uso en la directiva final lista para producción por razones de seguridad.
fr_fr: Indique que la stratégie créée/déployée aura les options de règle de stratégie (Enabled:Boot Audit on Failure) et (Enabled:Advanced Boot Options Menu). Utile pour tester la stratégie et disposer d'options de récupération en cas de problème. Non recommandé pour une utilisation dans la stratégie finale prête pour la production pour des raisons de sécurité.
he_il: מציין שהמדיניות שנוצרה/נפרסה תכלול את אפשרויות חוק המדיניות (מופעל: ביקורת אתחול בכשל) ו-(מופעל: תפריט אפשרויות אתחול מתקדמות). שימושי לבדיקת המדיניות ולהחזקת אפשרויות שחזור זמינות כאשר משהו משתבש. לא מומלץ לשימוש במדיניות הסופית המוכנה לייצור מסיבות אבטחה.
hi_in: निर्मित/तैनात नीति में (सक्रिय: विफलता पर बूट ऑडिट) और (सक्रिय: उन्नत बूट विकल्प मेनू) नीति नियम विकल्प होंगे। नीति का परीक्षण करने और जब कुछ गलत हो जाए तो पुनर्प्राप्ति विकल्प उपलब्ध रहे इसके लिए उपयोगी। सुरक्षा कारणों से अंतिम उत्पादन-तैयार नीति में उपयोग की अनुशंसा नहीं की जाती।
ja_jp: 作成/展開されたポリシーに (Enabled:Boot Audit on Failure) と (Enabled:Advanced Boot Options Menu) のポリシールールオプションが含まれることを示します。ポリシーのテストや、問題発生時の回復オプションを利用可能にする場合に役立ちます。セキュリティ上の理由から、最終的な本番環境対応ポリシーでの使用は推奨されません。
ml_in: സൃഷ്ടിച്ച/വിന്യസിച്ച നയത്തിന് (പ്രവർത്തനക്ഷമമാക്കി:പരാജയപ്പെട്ടാൽ ബൂട്ട് ഓഡിറ്റ്), (പ്രവർത്തനക്ഷമമാക്കി:അഡ്വാൻസ്ഡ് ബൂട്ട് ഓപ്ഷൻസ് മെനു) എന്നീ നയ നിയമ ഓപ്ഷനുകൾ ഉണ്ടായിരിക്കുമെന്ന് സൂചിപ്പിക്കുന്നു. നയം പരിശോധിക്കുന്നതിനും എന്തെങ്കിലും തെറ്റ് സംഭവിക്കുമ്പോൾ വീണ്ടെടുക്കൽ ഓപ്ഷനുകൾ ലഭ്യമാക്കുന്നതിനും ഇത് ഉപയോഗപ്രദമാണ്. സുരക്ഷാ കാരണങ്ങളാൽ അന്തിമ പ്രൊഡക്ഷൻ-റെഡി നയത്തിൽ ഉപയോഗിക്കാൻ ശുപാർശ ചെയ്യുന്നില്ല.
pl_pl: Wskazuje, że utworzone/wdrożone zasady będą miały opcje zasad (Włączone:Inspekcja rozruchu przy niepowodzeniu) oraz (Włączone:Menu zaawansowanych opcji rozruchu). Przydatne do testowania zasad i posiadania opcji odzyskiwania dostępnych, gdy coś pójdzie nie tak. Nie zaleca się stosowania w ostatecznych zasadach produkcyjnych ze względów bezpieczeństwa.
tr_tr: Oluşturulan/dağıtılan politikanın (Etkin: Arıza Durumunda Önyükleme Denetimi) ve (Etkin: Gelişmiş Önyükleme Seçenekleri Menüsü) politika kuralı seçeneklerine sahip olacağını belirtir. Politikayı test etmek ve bir şeyler ters gittiğinde kurtarma seçeneklerinin mevcut olmasını sağlamak açısından kullanışlıdır. Güvenlik nedeniyle nihai üretime hazır politikada kullanılması önerilmez.

# TestModeRuleOption.Header
source: Test Mode
ar: وضع الاختبار
de_de: Testmodus
el_gr: Λειτουργία Δοκιμής
es: Modo de prueba
fr_fr: Mode test
he_il: מצב בדיקה
hi_in: परीक्षण मोड
ja_jp: テストモード
ml_in: ടെസ്റ്റ് മോഡ്
pl_pl: Tryb testowy
tr_tr: Test Modu

# TestModeRuleOption.ToolTipService.ToolTip
source: Indicates that the created/deployed policy will have (Enabled:Boot Audit on Failure) and (Enabled:Advanced Boot Options Menu) policy rule options. Useful for testing the policy and having recovery options available when something goes wrong. Not recommended to be used in the final production-ready policy due to security reasons.
ar: يشير إلى أن النهج الذي تم إنشاؤه/نشره سيحتوي على خياري النهج (ممكّن: تدقيق التمهيد عند الفشل) و (ممكّن: قائمة خيارات التمهيد المتقدمة). مفيد لاختبار النهج وتوفير خيارات استرداد عند حدوث خطأ ما. لا يوصى باستخدامه في النهج النهائي الجاهز للإنتاج لأسباب أمنية.
de_de: Gibt an, dass die erstellte/bereitgestellte Richtlinie die Richtlinienregeloptionen (Enabled:Boot Audit on Failure) und (Enabled:Advanced Boot Options Menu) enthält. Nützlich zum Testen der Richtlinie und um Wiederherstellungsoptionen zur Verfügung zu haben, wenn etwas schiefgeht. Aus Sicherheitsgründen wird die Verwendung in der endgültigen produktionsreifen Richtlinie nicht empfohlen.
el_gr: Υποδεικνύει ότι η δημιουργημένη/αναπτυγμένη πολιτική θα έχει τις επιλογές κανόνων πολιτικής (Ενεργοποιημένο: Έλεγχος Εκκίνησης σε Αποτυχία) και (Ενεργοποιημένο: Προηγμένο Μενού Επιλογών Εκκίνησης). Χρήσιμο για τη δοκιμή της πολιτικής και τη διαθεσιμότητα επιλογών ανάκτησης όταν κάτι πάει στραβά. Δεν συνιστάται να χρησιμοποιείται στην τελική πολιτική έτοιμη για παραγωγή για λόγους ασφαλείας.
es: Indica que la directiva creada/implementada tendrá las opciones de regla de directiva (Habilitar:auditoría de arranque al fallar) y (Habilitar:menú de opciones avanzadas de arranque). Útil para probar la directiva y contar con opciones de recuperación disponibles cuando algo salga mal. No se recomienda su uso en la directiva final lista para producción por razones de seguridad.
fr_fr: Indique que la stratégie créée/déployée aura les options de règle de stratégie (Enabled:Boot Audit on Failure) et (Enabled:Advanced Boot Options Menu). Utile pour tester la stratégie et disposer d'options de récupération en cas de problème. Non recommandé pour une utilisation dans la stratégie finale prête pour la production pour des raisons de sécurité.
he_il: מציין שהמדיניות שנוצרה/נפרסה תכלול את אפשרויות חוק המדיניות (מופעל: ביקורת אתחול בכשל) ו-(מופעל: תפריט אפשרויות אתחול מתקדמות). שימושי לבדיקת המדיניות ולהחזקת אפשרויות שחזור זמינות כאשר משהו משתבש. לא מומלץ לשימוש במדיניות הסופית המוכנה לייצור מסיבות אבטחה.
hi_in: निर्मित/तैनात नीति में (सक्रिय: विफलता पर बूट ऑडिट) और (सक्रिय: उन्नत बूट विकल्प मेनू) नीति नियम विकल्प होंगे। नीति का परीक्षण करने और जब कुछ गलत हो जाए तो पुनर्प्राप्ति विकल्प उपलब्ध रहे इसके लिए उपयोगी। सुरक्षा कारणों से अंतिम उत्पादन-तैयार नीति में उपयोग की अनुशंसा नहीं की जाती।
ja_jp: 作成/展開されたポリシーに (Enabled:Boot Audit on Failure) と (Enabled:Advanced Boot Options Menu) のポリシールールオプションが含まれることを示します。ポリシーのテストや、問題発生時の回復オプションを利用可能にする場合に役立ちます。セキュリティ上の理由から、最終的な本番環境対応ポリシーでの使用は推奨されません。
ml_in: സൃഷ്ടിച്ച/വിന്യസിച്ച നയത്തിന് (പ്രവർത്തനക്ഷമമാക്കി:പരാജയപ്പെട്ടാൽ ബൂട്ട് ഓഡിറ്റ്), (പ്രവർത്തനക്ഷമമാക്കി:അഡ്വാൻസ്ഡ് ബൂട്ട് ഓപ്ഷൻസ് മെനു) എന്നീ നയ നിയമ ഓപ്ഷനുകൾ ഉണ്ടായിരിക്കുമെന്ന് സൂചിപ്പിക്കുന്നു. നയം പരിശോധിക്കുന്നതിനും എന്തെങ്കിലും തെറ്റ് സംഭവിക്കുമ്പോൾ വീണ്ടെടുക്കൽ ഓപ്ഷനുകൾ ലഭ്യമാക്കുന്നതിനും ഇത് ഉപയോഗപ്രദമാണ്. സുരക്ഷാ കാരണങ്ങളാൽ അന്തിമ പ്രൊഡക്ഷൻ-റെഡി നയത്തിൽ ഉപയോഗിക്കാൻ ശുപാർശ ചെയ്യുന്നില്ല.
pl_pl: Wskazuje, że utworzone/wdrożone zasady będą miały opcje zasad (Włączone:Inspekcja rozruchu przy niepowodzeniu) oraz (Włączone:Menu zaawansowanych opcji rozruchu). Przydatne do testowania zasad i posiadania opcji odzyskiwania dostępnych, gdy coś pójdzie nie tak. Nie zaleca się stosowania w ostatecznych zasadach produkcyjnych ze względów bezpieczeństwa.
tr_tr: Oluşturulan/dağıtılan politikanın (Etkin: Arıza Durumunda Önyükleme Denetimi) ve (Etkin: Gelişmiş Önyükleme Seçenekleri Menüsü) politika kuralı seçeneklerine sahip olacağını belirtir. Politikayı test etmek ve bir şeyler ters gittiğinde kurtarma seçeneklerinin mevcut olmasını sağlamak açısından kullanışlıdır. Güvenlik nedeniyle nihai üretime hazır politikada kullanılması önerilmez.

# TestModeRuleOption.AutomationProperties.HelpText
source: Indicates that the created/deployed policy will have (Enabled:Boot Audit on Failure) and (Enabled:Advanced Boot Options Menu) policy rule options. Useful for testing the policy and having recovery options available when something goes wrong. Not recommended to be used in the final production-ready policy due to security reasons.
ar: يشير إلى أن النهج الذي تم إنشاؤه/نشره سيحتوي على خياري النهج (ممكّن: تدقيق التمهيد عند الفشل) و (ممكّن: قائمة خيارات التمهيد المتقدمة). مفيد لاختبار النهج وتوفير خيارات استرداد عند حدوث خطأ ما. لا يوصى باستخدامه في النهج النهائي الجاهز للإنتاج لأسباب أمنية.
de_de: Gibt an, dass die erstellte/bereitgestellte Richtlinie die Richtlinienregeloptionen (Enabled:Boot Audit on Failure) und (Enabled:Advanced Boot Options Menu) enthält. Nützlich zum Testen der Richtlinie und um Wiederherstellungsoptionen zur Verfügung zu haben, wenn etwas schiefgeht. Aus Sicherheitsgründen wird die Verwendung in der endgültigen produktionsreifen Richtlinie nicht empfohlen.
el_gr: Υποδεικνύει ότι η δημιουργημένη/αναπτυγμένη πολιτική θα έχει τις επιλογές κανόνων πολιτικής (Ενεργοποιημένο: Έλεγχος Εκκίνησης σε Αποτυχία) και (Ενεργοποιημένο: Προηγμένο Μενού Επιλογών Εκκίνησης). Χρήσιμο για τη δοκιμή της πολιτικής και τη διαθεσιμότητα επιλογών ανάκτησης όταν κάτι πάει στραβά. Δεν συνιστάται να χρησιμοποιείται στην τελική πολιτική έτοιμη για παραγωγή για λόγους ασφαλείας.
es: Indica que la directiva creada/implementada tendrá las opciones de regla de directiva (Habilitar:auditoría de arranque al fallar) y (Habilitar:menú de opciones avanzadas de arranque). Útil para probar la directiva y contar con opciones de recuperación disponibles cuando algo salga mal. No se recomienda su uso en la directiva final lista para producción por razones de seguridad.
fr_fr: Indique que la stratégie créée/déployée aura les options de règle de stratégie (Enabled:Boot Audit on Failure) et (Enabled:Advanced Boot Options Menu). Utile pour tester la stratégie et disposer d'options de récupération en cas de problème. Non recommandé pour une utilisation dans la stratégie finale prête pour la production pour des raisons de sécurité.
he_il: מציין שהמדיניות שנוצרה/נפרסה תכלול את אפשרויות חוק המדיניות (מופעל: ביקורת אתחול בכשל) ו-(מופעל: תפריט אפשרויות אתחול מתקדמות). שימושי לבדיקת המדיניות ולהחזקת אפשרויות שחזור זמינות כאשר משהו משתבש. לא מומלץ לשימוש במדיניות הסופית המוכנה לייצור מסיבות אבטחה.
hi_in: निर्मित/तैनात नीति में (सक्रिय: विफलता पर बूट ऑडिट) और (सक्रिय: उन्नत बूट विकल्प मेनू) नीति नियम विकल्प होंगे। नीति का परीक्षण करने और जब कुछ गलत हो जाए तो पुनर्प्राप्ति विकल्प उपलब्ध रहे इसके लिए उपयोगी। सुरक्षा कारणों से अंतिम उत्पादन-तैयार नीति में उपयोग की अनुशंसा नहीं की जाती।
ja_jp: 作成/展開されたポリシーに (Enabled:Boot Audit on Failure) と (Enabled:Advanced Boot Options Menu) のポリシールールオプションが含まれることを示します。ポリシーのテストや、問題発生時の回復オプションを利用可能にする場合に役立ちます。セキュリティ上の理由から、最終的な本番環境対応ポリシーでの使用は推奨されません。
ml_in: സൃഷ്ടിച്ച/വിന്യസിച്ച നയത്തിന് (പ്രവർത്തനക്ഷമമാക്കി:പരാജയപ്പെട്ടാൽ ബൂട്ട് ഓഡിറ്റ്), (പ്രവർത്തനക്ഷമമാക്കി:അഡ്വാൻസ്ഡ് ബൂട്ട് ഓപ്ഷൻസ് മെനു) എന്നീ നയ നിയമ ഓപ്ഷനുകൾ ഉണ്ടായിരിക്കുമെന്ന് സൂചിപ്പിക്കുന്നു. നയം പരിശോധിക്കുന്നതിനും എന്തെങ്കിലും തെറ്റ് സംഭവിക്കുമ്പോൾ വീണ്ടെടുക്കൽ ഓപ്ഷനുകൾ ലഭ്യമാക്കുന്നതിനും ഇത് ഉപയോഗപ്രദമാണ്. സുരക്ഷാ കാരണങ്ങളാൽ അന്തിമ പ്രൊഡക്ഷൻ-റെഡി നയത്തിൽ ഉപയോഗിക്കാൻ ശുപാർശ ചെയ്യുന്നില്ല.
pl_pl: Wskazuje, że utworzone/wdrożone zasady będą miały opcje zasad (Włączone:Inspekcja rozruchu przy niepowodzeniu) oraz (Włączone:Menu zaawansowanych opcji rozruchu). Przydatne do testowania zasad i posiadania opcji odzyskiwania dostępnych, gdy coś pójdzie nie tak. Nie zaleca się stosowania w ostatecznych zasadach produkcyjnych ze względów bezpieczeństwa.
tr_tr: Oluşturulan/dağıtılan politikanın (Etkin: Arıza Durumunda Önyükleme Denetimi) ve (Etkin: Gelişmiş Önyükleme Seçenekleri Menüsü) politika kuralı seçeneklerine sahip olacağını belirtir. Politikayı test etmek ve bir şeyler ters gittiğinde kurtarma seçeneklerinin mevcut olmasını sağlamak açısından kullanışlıdır. Güvenlik nedeniyle nihai üretime hazır politikada kullanılması önerilmez.

# FileBrowseButton.Content
source: Browse
ar: استعراض
de_de: Durchsuchen
el_gr: Αναζήτηση
es: Examinar
fr_fr: Parcourir
he_il: עיין
hi_in: ब्राउज़ करें
ja_jp: 参照
ml_in: ബ്രൗസ് ചെയ്യുക
pl_pl: Przeglądaj
tr_tr: Göz at
